In [78]:
# Implicit indexing is an index number which is already given where as explicit indexing is a number which we can give i.e a[15] we can name it as "XYZ"
# .setIndex is used to change name of index
#  To delete a coloumn we use .drop(Column name, axis = 0, Inplace = True)
# .head() used to get or read first five rows of dataset 
#  .tail() is used to get last rows of data set you can add number to get the number of data 
#  .shape is used  to get shape of matrix 
# Conditional statement in panda:  "name > 17"
# ## Missing data are of 2 types Nan and None 
# isnull() used to check whether data has none value or not 
# .dropna() will remove the whole row if their is nan or none value 
#  .dropna(axis = 1) remove whole row and thres is an attribute which will remove the row according to number of NaN
# .fillna() used to fill some values in NaN section 
# .fillna(method = 'ffill') forward filling is a method whihc will copy previous data value into current NaN 
# disadv of forward is you can't do it if the NaN is in the first row at that time you will use bakcward filling 
# .fillna(method = 'vfill') vfill is backward filling which will copy next row value  into current NaN row 
# .replace(to replace = 'string',NaN)

# we are creating 1D series, series is used present data in 1D series

In [363]:
# we are creating 1D series, series is used present data in 1D series 
import numpy  as np
import pandas as pd
data   = [90,60,80,30]
vr = ["Aadil","Akshay ","Aamish","Arshil"]
sr = pd.Series(data,vr)
sr

Aadil      90
Akshay     60
Aamish     80
Arshil     30
dtype: int64

#  .dataframe () is used to represent data in 2D series

In [275]:
import numpy as  np
dt = [[90,60,80,60],[50,60,70,80]]
vr = ["Krish","Aadil"]

nmm = pd.DataFrame(dt, vr, columns = ["Math","Science","SS","Bio"])
nmm
# nmm["Math"]# to get specific data from the column

       Math  Science  SS  Bio
Krish    90       60  80   60
Aadil    50       60  70   80

# To get specific values from rows

In [276]:
nmm.loc[["Aadil"]]

       Math  Science  SS  Bio
Aadil    50       60  70   80

# Create 3 list viz. productId, Product Name, Product Price with 5 elements each.
Add this element to create a DataFrame.

In [277]:
pId= [101,102,103,104,105]
pNm= ["Chips","Drinks","Snacks","Maggie","Fruit Beer"]
pP=[100,50,55,80,500]
assi = {
    "Product Id"  : pId,
    "Product Name" : pNm,
    "Product Price" : pP
    
}
 
a = pd.DataFrame(assi)
a[1:4]

   Product Id Product Name  Product Price
1         102       Drinks             50
2         103       Snacks             55
3         104       Maggie             80

# Extract one by one column and display separately from above dataframe

In [8]:
a[["Product Id"]]

   Product Id
0         101
1         102
2         103
3         104
4         105

In [9]:
a[["Product Name"]]

  Product Name
0        Chips
1       Drinks
2       Snacks
3       Maggie
4   Fruit Beer

In [10]:
a[["Product Price"]]

   Product Price
0            100
1             50
2             55
3             80
4            500

# Display separately each and every row from an above dataframe. (use loc or iloc function)

In [11]:
a.loc[[0]]

   Product Id Product Name  Product Price
0         101        Chips            100

In [12]:
a.loc[[1]]

   Product Id Product Name  Product Price
1         102       Drinks             50

In [13]:
a.loc[[2]]

   Product Id Product Name  Product Price
2         103       Snacks             55

In [14]:
a.loc[[3]]

   Product Id Product Name  Product Price
3         104       Maggie             80

In [15]:
a.loc[[4]]

   Product Id Product Name  Product Price
4         105   Fruit Beer            500

# Display product name from 3 row using loc function

In [16]:
a.loc[3, "Product Name"]

'Maggie'

# Display price located in 2 row using iloc function

In [17]:
a.iloc[2]["Product Price"]

55

# Display 2nd to 4th row data excluding price

In [18]:
a.iloc[2:5]["Product Price"]

2     55
3     80
4    500
Name: Product Price, dtype: int64

#   Display 1 to 3rd row price data only

In [281]:
a.iloc[1:4]["Product Price"]

1    50
2    55
3    80
Name: Product Price, dtype: int64

#  Change marks in python column to 41 for students who have scored less than 40.

In [19]:
sr[sr < 40] = 41
sr

Aadil      90
Akshay     60
Aamish     80
Arshil     41
dtype: int64

# Add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100.

In [305]:
sr+=20

In [362]:
sr[sr > 100] = 100
sr

array([100,  80, 100,  50], dtype=int64)

#  Display students who have scored more than 50 marks in python and more than 60 marks in data Science.

In [325]:
import numpy as  np
dt = np.random.randint(1,100,8).reshape(2,4)
vr = ["Krish","Aadil"]

nmm = pd.DataFrame(dt, vr, columns = ["python","data science","SS","Bio"])
nmm[(nmm['python'] > 50) & (nmm['data science'] > 60)]

Empty DataFrame
Columns: [python, data science, SS, Bio]
Index: []

In [326]:
nmm

       python  data science  SS  Bio
Krish       6            43  45   27
Aadil      21            97   8   42

# Display students records whose name starts with letter S.

In [330]:
nmm[nmm.index.str.startswith('S')]

Empty DataFrame
Columns: [python, data science, SS, Bio]
Index: []

# 12. Display students records whose name ends with letter a.

In [331]:
nmm[nmm.index.str.startswith('A')]

       python  data science  SS  Bio
Aadil      21            97   8   42

In [332]:
nmm['total'] = nmm['python'] + nmm['data science'] + nmm['Bio'] + nmm['SS']

In [334]:
nmm['percentage '] = nmm['total']/4

In [335]:
nmm

       python  data science  SS  Bio  total  percentage
Krish       6            43  45   27    121       30.25
Aadil      21            97   8   42    168       42.00

# 14. Calculate Status (PASS / FAIL) for the Students.

In [342]:
nmm['status'] = np.where(nmm['percentage ']>40,'pass','fail')

In [343]:
nmm

       python  data science  SS  Bio  total  percentage status
Krish       6            43  45   27    121       30.25   fail
Aadil      21            97   8   42    168       42.00   pass

# #15. Calculate percentage  based grade  value
#  per>=90 then A-grade ,
#  per>=80 then B-grade ,
#  per>=70 then C-grade ,
#  per>=60 then D-grade ,
#  per>=50 then E-grade ,
#  per<50 then F-grade .

In [365]:
nmm.loc[nmm['percentage']<50,'grade '] = 'F' 
nmm.loc[nmm['percentage']>=50,'grade '] = 'E' 
nmm.loc[nmm['percentage']>=60,'grade '] = 'D' 
nmm.loc[nmm['percentage']>=70,'grade '] = 'C' 
nmm.loc[nmm['percentage']>=80,'grade '] = 'B' 
nmm.loc[nmm['percentage']>=90,'grade '] = 'A'

In [366]:
nmm

       python  data science  SS  Bio  total  percentage status grade
Krish       6            43  45   27    121       30.25   fail      F
Aadil      21            97   8   42    168       42.00   pass      F

 # 16. Also calculate overall columns total, maximum, minimum and standard
 # deviation for each numeric columns

In [375]:
print(nmm.sum())
print(nmm.std())
print(nmm.max())
print(nmm.min())
print(nmm.var())

python                27
data science         140
SS                    53
Bio                   69
total                289
percentage         72.25
status          failpass
grade                 FF
dtype: object

<ipython-input-375-4da1d4bbdbc8>:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(nmm.std())

python          10.606602
data science    38.183766
SS              26.162951
Bio             10.606602
total           33.234019
percentage       8.308505
dtype: float64
python            21
data science      97
SS                45
Bio               42
total            168
percentage      42.0
status          pass
grade              F
dtype: object
python              6
data science       43
SS                  8
Bio                27
total             121
percentage      30.25
status           fail
grade               F
dtype: object

<ipython-input-375-4da1d4bbdbc8>:5: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(nmm.var())

python           112.50000
data science    1458.00000
SS               684.50000
Bio              112.50000
total           1104.50000
percentage        69.03125
dtype: float64

 # 17. Display meta-data for each column for the above dataframe.

In [376]:
nmm.describe()

          python  data science         SS        Bio       total  percentage
count   2.000000      2.000000   2.000000   2.000000    2.000000    2.000000
mean   13.500000     70.000000  26.500000  34.500000  144.500000   36.125000
std    10.606602     38.183766  26.162951  10.606602   33.234019    8.308505
min     6.000000     43.000000   8.000000  27.000000  121.000000   30.250000
25%     9.750000     56.500000  17.250000  30.750000  132.750000   33.187500
50%    13.500000     70.000000  26.500000  34.500000  144.500000   36.125000
75%    17.250000     83.500000  35.750000  38.250000  156.250000   39.062500
max    21.000000     97.000000  45.000000  42.000000  168.000000   42.000000

 # 18. Convert the above DataFrame to list within a dictionary.

In [377]:
nmm.to_dict(orient='list')

{'python': [6, 21],
 'data science': [43, 97],
 'SS': [45, 8],
 'Bio': [27, 42],
 'total': [121, 168],
 'percentage': [30.25, 42.0],
 'status': ['fail', 'pass'],
 'grade ': ['F', 'F']}

 # 19. Convert this dictionary again to a separate dataframe by adding 500
 # to each element in product price column

In [378]:
a['Product Price']+=500
a

   Product Id Product Name  Product Price
0         101        Chips            600
1         102       Drinks            550
2         103       Snacks            555
3         104       Maggie            580
4         105   Fruit Beer           1000

# 1. Import pandas as pd.

In [1]:
import pandas as pd

# Read Salaries.csv as a dataframe called sal.

In [4]:

sal =  pd.read_csv("Salaries.csv")

<ipython-input-4-981ba06638b0>:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal =  pd.read_csv("Salaries.csv")

# 3. Check the head of the DataFrame.

In [5]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

# 4. Use the .info() method to find out how many entries there are.

In [6]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 10.2+ MB

# 5. What is the average BasePay ?

In [9]:
import numpy as np
sal['BasePay'] = sal['BasePay'].replace(to_replace='Not Provided', value=np.nan).fillna(1)
sal['BasePay'] = sal['BasePay'].astype(float)
sal['BasePay'].mean()

66053.73338483997

# 6. What is the highest amount of OvertimePay in the dataset ?

In [11]:
sal['OvertimePay'] = sal['OvertimePay'].replace(to_replace = 'Not Provided',value = np.nan).fillna(1)
sal['OvertimePay'] = sal['OvertimePay'].astype('float')
sal['OvertimePay'].max()

245131.88

#  What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer# that doesn't match up (there is also a lowercase Joseph Driscoll).

In [12]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

# How much does JOSEPH DRISCOLL make (including benefits)?

In [13]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

# What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer
# that doesn't match up (there is also a lowercase Joseph Driscoll).

In [15]:
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

# ** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [16]:
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

# What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [17]:
sal.groupby('Year').mean()['BasePay']

<ipython-input-17-a42aa5aba483>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    68509.848243
2014    66557.437855
Name: BasePay, dtype: float64

# how many unique job titles are there?

In [19]:
sal['JobTitle'].nunique()

2159

# What are the top 5 most common jobs?

In [20]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

# 14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only# one occurence in 2013?

In [22]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

# 15. How many people have the word Chief in their job title?

In [25]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

627

# 16. Is there a correlation between length of the Job Title string and Salary?

# practice question

In [21]:
sal.groupby('Year').mean()['BasePay']

<ipython-input-21-a42aa5aba483>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    68509.848243
2014    66557.437855
Name: BasePay, dtype: float64

In [14]:
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [22]:
# 
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [156]:
# df.head()
df["BasePay"].mean()

66053.73338483997

In [24]:
df.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [25]:
df.shape

(148654, 13)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 10.2+ MB

In [111]:
df['BasePay'] = df['BasePay'].replace(to_replace='Not Provided', value=np.nan).fillna(1)
df['BasePay'] = df['BasePay'].astype(float)
df['BasePay'].mean()

66053.73338483997

In [27]:
# you have to check data that it should not contain any NaN value and if it their then you have to clean your data as it works as a virus for your dataset, you add average of data in that place to clean your data

In [112]:
df.describe()

,Id,BasePay,TotalPay,TotalPayBenefits,Year,Notes
count,148654.000000,148654.000000,148654.000000,148654.000000,148654.000000,0.0
mean,74327.500000,66053.733385,74768.321972,93692.554811,2012.522643,NaN
std,42912.857795,42886.704848,50517.005274,62793.533483,1.117538,NaN
min,1.000000,-166.010000,-618.130000,-618.130000,2011.000000,NaN
25%,37164.250000,32792.545000,36168.995000,44065.650000,2012.000000,NaN
50%,74327.500000,64861.600000,71426.610000,92404.090000,2013.000000,NaN
75%,111490.750000,94605.740000,105839.135000,132876.450000,2014.000000,NaN
max,148654.000000,319275.010000,567595.430000,567595.430000,2014.000000,NaN

In [30]:
# called that file 
df.iloc[24]["JobTitle"]

'CAPTAIN, FIRE SUPPRESSION'

In [61]:
# a = pd.DataFrame(columns="Science","Bio","Math",data= np.random.randint(1,100,4))
a = np.random.randint(1,100,(4,3))

b = "Python Bio Math"
c = "Aamish Aadil Akshay Krish"
Ss = pd.DataFrame(columns=b.split(),data=a,index=c.split())

In [32]:
Ss.loc[Ss["Python"]<40,"Python"] = 41
Ss

        Python  Bio  Math
Aamish      54   25    17
Aadil       59   36    53
Akshay      75   79    33
Krish       41   55    42

In [33]:
n_data = Ss[:]+13

In [34]:
n_data[n_data[:]>100]=100

In [35]:
n_data

        Python  Bio  Math
Aamish      67   38    30
Aadil       72   49    66
Akshay      88   92    46
Krish       54   68    55

In [42]:
# my logic 
for i in a:
    for j in a[i]:
        if (j>100):
            a[i]=100
a

        Python  Bio  Math
Aamish      54   25    17
Aadil       59   36    53
Akshay      75   79    33

In [37]:
Ss

        Python  Bio  Math
Aamish      54   25    17
Aadil       59   36    53
Akshay      75   79    33
Krish       41   55    42

In [38]:
a = Ss[Ss["Python"]>50]
a
b = Ss[Ss["Bio"]>30]
b

        Python  Bio  Math
Aadil       59   36    53
Akshay      75   79    33
Krish       41   55    42

In [39]:
Ss[(Ss["Python"]>50)&(Ss["Bio"]>30)]

        Python  Bio  Math
Aadil       59   36    53
Akshay      75   79    33

In [40]:
Ss[Ss.index.str.startswith("K")]

       Python  Bio  Math
Krish      41   55    42

In [44]:
(Ss[Ss.index.str.startswith("K")])

       Python  Bio  Math
Krish      41   55    42

In [54]:
(Ss[Ss.index.str.startswith("A")])

        Python  Bio  Math     Total  Percentage
Aamish      54   25    17   515.328    103.0656
Aadil       59   36    53   794.464    158.8928
Akshay      75   79    33  1003.816    200.7632

In [53]:
(Ss[Ss.index.str.startswith("N")])

Empty DataFrame
Columns: [Python, Bio, Math, Total, Percentage]
Index: []

In [62]:
Ss['Total'] = Ss.sum(axis=1)
Ss['percentage '] = (Ss['Total'] / 300) * 100

In [63]:
Ss

        Python  Bio  Math  Total  Percentage
Aamish      59    8    12     79   26.333333
Aadil       53    8    93    154   51.333333
Akshay      39   62    31    132   44.000000
Krish       86   29    28    143   47.666667

In [70]:
Ss['Status'] = np.where(Ss['percentage '] < 40, 'Fail', 'Pass')

In [71]:
Ss

        Python  Bio  Math  Total  Percentage Status
Aamish      59    8    12     79   26.333333   Fail
Aadil       53    8    93    154   51.333333   Pass
Akshay      39   62    31    132   44.000000   Pass
Krish       86   29    28    143   47.666667   Pass

In [118]:
Ss.loc[Ss['percentage ']<50,'grade '] = 'F' 
Ss.loc[Ss['percentage ']>=50,'grade '] = 'E' 
Ss.loc[Ss['percentage ']>=60,'grade '] = 'D' 
Ss.loc[Ss['percentage ']>=70,'grade '] = 'C' 
Ss.loc[Ss['percentage ']>=80,'grade '] = 'B' 
Ss.loc[Ss['percentage ']>=90,'grade '] = 'A'

In [119]:
Ss

        Python  Bio  Math  Total  Percentage Status Grade
Aamish      59    8    12     79   26.333333   Fail     F
Aadil       53    8    93    154   51.333333   Pass     E
Akshay      39   62    31    132   44.000000   Pass     F
Krish       86   29    28    143   47.666667   Pass     F

In [121]:
Ss.sum()  # Overall total for each column

Python                     237
Bio                        107
Math                       164
Total                      508
Percentage          169.333333
Status        FailPassPassPass
Grade                     FEFF
dtype: object

In [122]:
Ss.max()

Python               86
Bio                  62
Math                 93
Total               154
Percentage    51.333333
Status             Pass
Grade                 F
dtype: object

In [123]:
Ss.min()

Python               39
Bio                   8
Math                 12
Total                79
Percentage    26.333333
Status             Fail
Grade                 E
dtype: object

In [124]:
Ss.nmm()

<ipython-input-124-916ca6ead70e>:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  Ss.std()

Python        19.704060
Bio           25.500000
Math          35.655762
Total         33.236526
Percentage    11.078842
dtype: float64

In [125]:
Ss.var()

<ipython-input-125-b00c90776dc9>:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  Ss.var()

Python         388.250000
Bio            650.250000
Math          1271.333333
Total         1104.666667
Percentage     122.740741
dtype: float64

In [130]:
Ss.describe()

         Python    Bio       Math       Total  Percentage
count   4.00000   4.00   4.000000    4.000000    4.000000
mean   59.25000  26.75  41.000000  127.000000   42.333333
std    19.70406  25.50  35.655762   33.236526   11.078842
min    39.00000   8.00  12.000000   79.000000   26.333333
25%    49.50000   8.00  24.000000  118.750000   39.583333
50%    56.00000  18.50  29.500000  137.500000   45.833333
75%    65.75000  37.25  46.500000  145.750000   48.583333
max    86.00000  62.00  93.000000  154.000000   51.333333

In [134]:
dic = Ss.to_dict(orient='list')
dic

{'Python': [59, 53, 39, 86],
 'Bio': [8, 8, 62, 29],
 'Math': [12, 93, 31, 28],
 'Total': [79, 154, 132, 143],
 'Percentage': [26.333333333333332,
  51.33333333333333,
  44.0,
  47.66666666666667],
 'Status': ['Fail', 'Pass', 'Pass', 'Pass'],
 'Grade': ['F', 'E', 'F', 'F']}

In [135]:
Ss['Total']+=500

In [136]:
Ss

        Python  Bio  Math  Total  Percentage Status Grade
Aamish      59    8    12    579   26.333333   Fail     F
Aadil       53    8    93    654   51.333333   Pass     E
Akshay      39   62    31    632   44.000000   Pass     F
Krish       86   29    28    643   47.666667   Pass     F

# Task 2

In [185]:
import pandas as pd

In [186]:
sal = pd.read_csv('Salaries.csv')

<ipython-input-186-13aeaf90a974>:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('Salaries.csv')

In [187]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [191]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148654 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(6)
memory usage: 11.3+ MB

In [192]:
sal['BasePay'].mean()

66053.73338483997

In [189]:
sal['BasePay'] = sal['BasePay'].replace(to_replace = 'Not Provided',value = np.nan).fillna(1)
sal['BasePay'] = sal['BasePay'].astype('float')

245131.88

In [195]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [194]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [158]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]['EmployeeName']
# Yes, the lowest paid person appears to have negative total pay.

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [161]:
sal.groupby('Year').mean()['BasePay']

<ipython-input-161-a42aa5aba483>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    68509.848243
2014    66557.437855
Name: BasePay, dtype: float64

In [162]:
sal['JobTitle'].nunique()

2159

In [196]:
sal['JobTitle'].value_counts().tail(5)

CHIEF HOUSING INSPECTOR                           1
TRAFFIC SIGNAL OPERATOR                           1
COURT COMPUTER FACILITIES COORDINATOR             1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I    1
VICTIM & WITNESS TECHNICIAN                       1
Name: JobTitle, dtype: int64

In [200]:
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

In [165]:
sum(sal['JobTitle'].apply(lambda x: 'chief' in x.lower()))

627

In [166]:
sal['title_len'] = sal['JobTitle'].apply(len)
sal[['title_len', 'TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

In [248]:
df  = pd.read_csv('Salaries.csv')

<ipython-input-248-21b9523d7ca3>:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df  = pd.read_csv('Salaries.csv')

In [249]:
df = df.replace(to_replace = 'Not Provided', value = np.nan)

In [250]:
df.fillna(method = 'ffill')
df.fillna(method = 'bfill')
df.fillna(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,5,567595.43,567595.43,2011,5.0,San Francisco,5
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,5,538909.28,538909.28,2011,5.0,San Francisco,5
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,5,335279.91,335279.91,2011,5.0,San Francisco,5
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,5,332343.61,332343.61,2011,5.0,San Francisco,5
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,5,326373.19,326373.19,2011,5.0,San Francisco,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,5.0,San Francisco,PT
148650,148651,Not provided,Not provided,5,5,5,5,0.00,0.00,2014,5.0,San Francisco,5
148651,148652,Not provided,Not provided,5,5,5,5,0.00,0.00,2014,5.0,San Francisco,5
148652,148653,Not provided,Not provided,5,5,5,5,0.00,0.00,2014,5.0,San Francisco,5
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,5.0,San Francisco,PT

In [263]:
df["EmployeeName"] = df['EmployeeName'].replace(to_replace= "Not Provided", value = np.nan)
df["EmployeeName"] = df['EmployeeName'].replace(to_replace= "Not provided", value = np.nan)

In [265]:
df['EmployeeName'] = df['EmployeeName'].fillna(method = 'ffill')

In [266]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Roy I Tillery,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Roy I Tillery,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Roy I Tillery,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [269]:
df["JobTitle"] = df['JobTitle'].replace(to_replace= "Not provided", value = np.nan)
df['JobTitle'] = df['JobTitle'].fillna(method = 'ffill')

In [270]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Roy I Tillery,Custodian,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Roy I Tillery,Custodian,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Roy I Tillery,Custodian,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [272]:
df = df.replace(to_replace = 'Not Provided', value = np.nan)
df.fillna(method = 'ffill')
df.fillna(method = 'bfill')
df.fillna(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,5,567595.43,567595.43,2011,5.0,San Francisco,5
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,5,538909.28,538909.28,2011,5.0,San Francisco,5
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,5,335279.91,335279.91,2011,5.0,San Francisco,5
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,5,332343.61,332343.61,2011,5.0,San Francisco,5
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,5,326373.19,326373.19,2011,5.0,San Francisco,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,5.0,San Francisco,PT
148650,148651,Roy I Tillery,Custodian,5,5,5,5,0.00,0.00,2014,5.0,San Francisco,5
148651,148652,Roy I Tillery,Custodian,5,5,5,5,0.00,0.00,2014,5.0,San Francisco,5
148652,148653,Roy I Tillery,Custodian,5,5,5,5,0.00,0.00,2014,5.0,San Francisco,5
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,5.0,San Francisco,PT